[
    {
        "id": 0,

        "image": "./assets/compressed/introcity-min.gif",

        "story": "Would you like to explore the city?",
        "choices": [
            "Venture forward"
        ]
    },
    {
        "id": 1,

        "image": "./assets/compressed/alleywayv2-min.gif",

        "story": "The trails are busy. You've never seen anything like this. Monstrous figures pass in a blur, their growls are loud and eyes are glowing. ",
        "choices": [
            "Hide in the nearby alley",
            "Continue exploring..."
        ],
        "decision": [2, 3]
    },
    {
        "id": 2,

        "image": "./assets/compressed/alleyrat-min.gif",

        "story": "You made it to calm space in between the towering mountains that surround you. The rumble of the monsters recedes into the background. Your stomach is growling... You haven't eaten for days. You notice some rats feeding on scraps. Fixated on your prey, you...",
        "choices": [
            "Go straight for the pounce",
            "Play it slow, sneak up behind the dumpster"
        ],
        "decision": [4, 5]
    },
    {
        "id": 3,

        "image": "./assets/compressed/carscenev3-min.gif",

        "story": "You press forward on high alert. What is that beautiful light in the distance... You leap for your life, narrowly avoiding what seemed like sure death. The monster roared on, as if it did not even notice you. Lucky to have avoied the monster's gaze, you creep through the shadows to a narrow opening nearby.",
        "choices": [
            "Continue..."
        ],
        "decision": [2],
        "badchoice": true
        
    },
    {
        "id": 4,

        "image": "./assets/compressed/alleyAfter-min.gif",

        "story": "The paltry rodents scurry away before you come within a paws length. They take their scraps with them and you are left alone in the dark, hungry for the night...",
        "choices": [
            "Continue..."
        ],
        "decision": [6],
        "badchoice": true
    },
    {
        "id": 5,

        "image": "./assets/compressed/alleyAfter-min.gif",

        "story": "You sneak through the rough terrain, slowly creeping towards your prey. You wait for just the right moment and leap for your first chance of nourishment in days. The furry creatures scamper away, leaving their meager scraps behind. The taste of rot will be enough to hold you over.",
        "choices": [
            "Continue..."
        ],
        "decision": [6]
    },
    {
        "id": 6,

        "image": "./assets/compressed/girlscene-min.gif",

        "story": "You emerge from the pass to find trails full of life. You have only heard of the rumored humans before but now they stand before you. A small one approaches you. She looks harmless.",
        "choices": [
            "Let her approach","Scurry away"
        ],
        "decision": [7,8]
    },
    {
        "id": 7,

        "image": "./assets/compressed/broomscene-min.gif",

        "story": "The small human reaches towards you slowly in a calm manner. Behind her a larger human approaches. She seems less gentle. Must be the humans mother. In a swift movement the mother swings at you with a large stick. You escape with minor injury. That was a close call.",
        "choices": [
            "Continue..."
        ],
        "decision": [8],
        "badchoice": true
    },
    {
        "id": 8,
        "image": "./assets/compressed/piescene-min.gif",
        "story": "You flee around the corner of the large structures surrounding you. A mouth watering smell wafts through the air. Atop a hole in the structure beside you sits a feast you have never seen before. It smells so good, but you can hear more humans inside.",
        "choices": [
            "Eat it","Better not take another risk"
        ],
        "decision": [9,10]
    },
    {
        "id": 9,
        "image": "./assets/compressed/eatpiescene-min.gif",
        "story": "NOM NOM MUNCH MUNCH YUMMY FREAKIN PIE!!!!!",
        "choices": [
            "WOOOHOOOOO!"
        ],
        "decision": [10]
    },
    {
        "id": 10,
        "image": "./assets/homelessv2before.png",
        "story": "You move along, avoiding mucky puddles and the loud noises that surround you. You turn a corner and in front of you is another human. He is different than the others. His scent is closer to yours than the others. He looks at you and then turns around to grab something. He pulls out a container of water and pours it in a bowl. He looks at you one more time before he turns back around and lays down. You could definitely use some fresh water to drink.",
        "choices": [
            "Drink the water","You can't trust him"
        ],
        "decision": [11,12]
    },
    {
        "id": 11,
        "image": "./assets/homelessv2after.png",
        "story": "You approach the bowl and finally drink the water your body needs so badly. The man doesn't move an inch.",
        "choices": [
            "Continue..."
        ],
        "decision": [12]
    },
    {
        "id": 12,
        "image": "./assets/compressed/birdintree-min.gif",
        "story": "You think back to your time in the woods, how you would enjoy chasing the lizards and birds around. What kind of predicament have you gotten yourself into? As you try to gain composure a bird swoops by you and lands on a nearby tree.",
        "choices": [
            "Chase it","There are other things to focus on"
        ],
        "decision": [13,25]
    },
    {
        "id": 13,
        "image": "./assets/compressed/catintree-min.gif",
        "story": "You make a giant leap at the bird, feeling the thrill of hunting you used to get. Just as your killer instincts flood your veins the feeling vanishes. The bird gets away as you come to terms with the real mess you are in. You sit, perched on the branch where the bird once was. You realize how high up you actually are. To your right there is a safe way to get even higher up.",
        "choices": [
            "Jump back down to the ground","Climb to the top of the structure"
        ],
        "decision": [14,15]
    },
    {
        "id": 14,
        "image": "./assets/compressed/jumpfromtree-min.gif",
        "story": "You leap from the tree to the hard ground. As you hit the ground you realize how much this 'adventure' has taken a toll on your body.",
        "choices": [
            "Continue..."
        ],
        "decision": [25],
        "badchoice": true
    },
    {
        "id": 15,
        "image": "./assets/compressed/roofview-min.gif",
        "story": "You can see so far. The monsters don't even look scary from up here. You take a moment of peace watching the tiny humans pass before pressing on.",
        "choices": [
            "Continue..."
        ],
        "decision": [16]
    },
    {
        "id": 16,
        "image": "./assets/compressed/chimney-min.gif",
        "story": "You wander the stucture's peak and encounter a mysterious column emitting heat. There is a weird dark could looming above it. You are cold and need a place to stay warm for the night.",
        "choices": [
            "Lay in the warmth","Search for a way down"
        ],
        "decision": [17,18]
    },
    {
        "id": 17,
        "image": "./assets/compressed/toomuchsmoke-min.gif",
        "story": "You lay down in the comforting heat and feel at ease for once. After a short time the looming cloud above you becomes too much to handle. Your lungs begin to hurt and you cannot breathe. You run off and must seek new shelter.",
        "choices": [
            "Continue..."
        ],
        "decision": [18],
        "badchoice": true
    },
    {
        "id": 18,
        "image": "./assets/compressed/boxchoice-min.gif",
        "story": "You are so tired, your eyes feel they need to close. There is an old box sitting in front of you. It looks wet and old, but better than sleeping out in the cold.",
        "choices": [
            "Seek shelter in the box","Look for a way down"
        ],
        "decision": [19,20]
    },
    {
        "id": 19,
        "image": "./assets/compressed/boxspiders-min.gif",
        "story": "You jump inside the box and something doesn't feel right. You feel slight movement all around you. You realize what is happening and suddenly you leap out of the box. Spiders are already crawling on you as you try to shake them off your fur. Looks like you need to find another spot for the night.",
        "choices": [
            "Continue..."
        ],
        "decision": [20],
        "badchoice": true
    },
    {
        "id": 20,
        "image": "./assets/compressed/roofjumpdecide-min.gif",
        "story": "You find the edge of the towering cliff. Across the gap to the other structure there is a way down. It seems far but you have made larger leaps before.",
        "choices": [
            "Take the leap","Find another way"
        ],
        "decision": [22,21]
    },
    {
        "id": 21,
        "image": "./assets/compressed/roofjumpdecide-min.gif",
        "story": "You circle the perimeter of the structure one more time and find another way down. You climb down the rusty stairs until you reach the ground.",
        "choices": [
            "Continue..."
        ],
        "decision": [23]
    },
    {
        "id": 22,
        "image": "./assets/compressed/roofjumpafter-min.gif",
        "story": "You make the leap to the structure across from you. Maybe it was a poor take off or maybe you were just unaware of the physical toll tonight has had on your body. You fall short of the jump, clawing at your metal escape route to no avail. You free fall down the side of the structure, plummeting towards the ground. Luckily you land in an open bin below you filled with human trash. The pain is significant but their rubbish cushioned the fall enough to walk away.",
        "choices": [
            "Continue..."
        ],
        "decision": [23],
        "badchoice": true
    },
    {
        "id": 23,
        "image": "./assets/findman.png",
        "story": "You feel on the brink of collapsing. You need to find some warmth or shelter first, or who knows if you will survive the night. You notice a familiar smell. A comforting smell. You peer around and the strange man from earlier lays before you again.",
        "choices": [
            "Continue..."
        ],
        "decision": [24]
      
    },
    {
        "id": 24,
        "image": "./assets/compressed/ending1noloop-min.gif",
        "story": "You don't trust humans, but this one seems special. Out of desparation you make your way to him and lay on the warmth of the cloth surrounding him. You notice him look at you and make slow movements. He takes the cloth and gently places it around you. It is warmer than you have felt all night.",
        "choices": [
            "Goodnight..."
        ],

        "end": true
    },
    {
        "id": 25,
        "image": "./assets/compressed/parkscene-min.gif",
        "story": "You observe your surroundings. Trees tower over you left and right. In the distance a light flickers. It seems the monsters don't live here.",
        "choices": [
            "Continue..."
        ],
        "decision": [26]
       
    },
    {
        "id": 26,
        "image": "./assets/compressed/shadowscene-min.gif",
        "story": "Wait, what is that? It's so dark but I think I see something over there. HELLOOOOO, I come in peace!",
        "choices": [
            "Better not risk it", "Check it out"
        ],
        "decision": [27,28]
    },
    {
        "id": 27,
        "image": "./assets/compressed/boxscene-min.gif",
        "story": "The air around you sends shivers down your spine. The temperature is dropping quickly. There is a cave ahead.",
        "choices": [
            "Seek shelter in the cave", "Keep looking"
        ],
        "decision": [29,30]
    },
    {
        "id": 28,
        "image": "./assets/compressed/dogparkscene-min.gif",
        "story": "A figure emerges from the darkness, snarling and foaming by the mouth. You don't want to stick around to find out what it is.",
        "choices": [
            "Continue..."
        ],
        "decision": [27],
        "badchoice": true
    },
    {
        "id": 29,
        "image": "./assets/compressed/insideboxscene-min.gif",
        "story": "Inside the cave you are caught off guard. In front of you a little one is taking shelter from the elements, probably alone, just like you. How could it be here alone? You nuzzle up and try to keep it warm when you notice a scent surrounding you. Must be the scent of its mother...",
        "choices": [
            "Stand your ground", "Abandon your only shelter"
        ],
        "decision": [31,32]
    }, 
    {
        "id": 30,
        "image": "./assets/compressed/kittenboxscene-min.gif",
        "story": "You turn your back to the cave and begin to walk when you hear a faint noise behind you. Did you hear that right? There it is again. The faint cry of a young one... You investigate the cave.",
        "choices": [
            "Continue..."
        ],
        "decision": [29]
    },
    {
        "id": 31,
        "image": "./assets/compressed/mothercatscene-min.gif",
        "story": "The mother has returned. Upon seeing you she extends her claws, ready to defend her young. She swipes at you but you escape with only a scratch.",
        "choices": [
            "Continue..."
        ],
        "decision": [32],
        "badchoice": true
    },
    {
        "id": 32,
        "image": "./assets/compressed/animalcontrolscene-min.gif",
        "story": "As you escape you scurry through the streets. The sounds of your pursuer become faint. Just as you think you are safe you notice you have a new pursuer. A human. It seems like he is trying to speak to you...",
        "choices": [
            "Escape to the darkness", "Let him approach"
        ],
        "decision": [33,34]
    },
    {
        "id": 33,
        "image": "./assets/compressed/cemeteryscene-min.gif",
        "story": "You keep running until you can't anymore. A cool breeze sweeps the grass around you and cold stones protrude from the ground. There are only a few humans here. They are somber and quiet. The atmosphere is calm here.",
        "choices": [
            "Continue..."
        ],
        "decision": [35]
    },
    {
        "id": 34,
        "image": "./assets/compressed/runfromacscene-min.gif",
        "story": "The human lunges, aggresively grabbing at you. You leap away but he catches you by the tail. You swing your body around and manage to claw through his grip. He winces in pain as you run for your life.",
        "choices": [
            "Continue..."
        ],
        "decision": [33],
        "badchoice": true
    },
    {
        "id": 35,
        "image": "./assets/compressed/endingcemeteryscene-min.gif",
        "story": "You lay on the cold stone thinking, \"finally some peace.\"",
        "choices": [
            "Goodnight..."
        ],
        "end": true
    }
]